ＲＩＳＣ　(縮小命令セットコンピュータ）ＣＰＵ内部を単純な命令のみで構成

ＣＩＳＣ（複雑命令セットコンピュータ）ＣＰＵ内部を複雑な命令から単純な命令に変換して複雑な処理を行う

オペランドフェッチ(メモリの有効あどれすのデータをプロセッサに格納する）

リトルエンディアン　データの下位バイト（位が少ないほう、数として小さい）からメモリに並べる

ビックエンディアン　データの上位バイト（数としてが多いほう、位多い）からメモリに並べる

~プロセッサ~

制御装置の中にあるの

PC(プログラムカウンタ）現在実行中の命令や次の命令のあどれすが格納

演算処理にあるもの

ＦＲ（フラグレジスタ）演算結果の正負の情報を格納

ＡＬＵ（算術論理演算子）算術演算、演算をする

レジスタ

ＩＲ（命令レジスタ）命令を格納する

ＭＡＲ（メモリアドレスレジスタ）取り込むデータのあどれす入る

ＭＤＲ（メモリデータレジスタ）メモリに書き込むデータ取り込む

その他

ＧＲ（汎用レジスタ）演算対象、あどれす格納などをする

スタックポインタ　メモリで最も参照したあどれすを記憶

アキュムレータ　　一時的な演算結果を保存